app/views/tasks/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= f.label :user_id %><br>
    <%= f.collection_select :user_id, User.all, :id, :login, multiple: true, :prompt => "Please Select" %>