app/views/tasks/show.html.erb

  <strong>Sprint:</strong>
  <% Sprint.where(:id => @task.sprint_id).each do |sprint| %>
---
SELECT "sprints".* FROM "sprints" WHERE "sprints"."id" IS NULL

  <strong>User:</strong>
  <% User.where(:id => @task.user_id).each do |user| %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1