app/views/users/_form.html.erb


<%= f.collection_select :project_id, Project.all, :id, :name, {prompt: "Select a project"}, {class: "form-control"} %>
---
SELECT "projects".* FROM "projects"