app/views/users/edit.html.erb

SELECT "projects".* FROM "projects"
---

<%= f.collection_select :project_id, Project.all, :id, :name, {prompt: "Select a project"}, {class: "form-control"} %>