app/views/sprints/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."sprint_id" = 12
---
  <tbody>
  	<% Task.where(:sprint_id => @sprint.id).each do |task| %>