app/views/projects/_form.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
    <!-- Pole niewidoczne -->
  <% @user =  User.find_by(id: session[:user_id]) %>