app/views/projects/edit.html.erb

SELECT "sprints".* FROM "sprints" WHERE "sprints"."project_id" = 1
---
  <tbody>
  	<% Sprint.where(:project_id => @project.id).each do |sprint| %>

SELECT "users".* FROM "users" WHERE "users"."project_id" = 1
---
  <tbody>
    <% User.where(:project_id => @project.id).each do |user| %>

SELECT "users".* FROM "users"
---
<select name="Users">
                 <% User.all.each do |user| %>