app/views/projects/show.html.erb

       <strong>Product owner:</strong>
          <% User.where(:id => @project.user_id).each do |user| %>
---
SELECT "users".* FROM "users" WHERE "users"."project_id" = 1

  <tbody>
  	<% Sprint.where(:project_id => @project.id).each do |sprint| %>
---
SELECT "sprints".* FROM "sprints" WHERE "sprints"."project_id" IS NULL