app/controllers/product_owner_controller.rb

 def index
    @projects = Project.all;
    @users = User.all
---
SELECT "projects".* FROM "projects"
SELECT "users".* FROM "users"