app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
SELECT "users".* FROM "users"
---
  def index

   @projects = Project.all
   @users = User.all

UPDATE "users" SET "first_name" = 'Alice' WHERE "users"."login" = 'test'
---
  def addUser
    @login = params[:Users];
    @projectId = params[:project_id]

   User.where(:login => @login).update_all(:project_id => @projectId)

INSERT INTO "projects" ("created_at", "description", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 08 May 2016 13:13:00 UTC +00:00], ["description", "aaasdas"], ["name", "projekt6"], ["updated_at", Sun, 08 May 2016 13:13:00 UTC +00:00], ["user_id", 18]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE "projects" SET "description" = ?, "updated_at" = ? WHERE "projects"."id" = 6  [["description", ""], ["updated_at", Sat, 30 Apr 2016 09:01:59 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @project.update(project_params)