app/controllers/sessions_controller.rb

  def create
  	user = User.find_by(login: params[:login])
---
SELECT "users".* FROM "users" WHERE "users"."login" = 'admin' LIMIT 1