app/controllers/sprints_controller.rb

  def index
    @sprints = Sprint.all
---
SELECT "sprints".* FROM "sprints"

  def create
    @sprint = Sprint.new(sprint_params)

    respond_to do |format|
      if @sprint.save
---
INSERT INTO "sprints" ("created_at", "name", "project_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 25 Apr 2016 20:50:50 UTC +00:00], ["name", "wyglad"], ["project_id", 1], ["updated_at", Mon, 25 Apr 2016 20:50:50 UTC +00:00]]

  def update
    respond_to do |format|
      if @sprint.update(sprint_params)
---
UPDATE "sprints" SET "project_id" = ?, "updated_at" = ? WHERE "sprints"."id" = 1  [["project_id", 2], ["updated_at", Mon, 25 Apr 2016 20:23:58 UTC +00:00]]

  def destroy
    @sprint.destroy
---
DELETE FROM "sprints" WHERE "sprints"."id" = ?  [["id", 4]]

    def set_sprint
      @sprint = Sprint.find(params[:id])
---
SELECT "sprints".* FROM "sprints" WHERE "sprints"."id" = ? LIMIT 1  [["id", "4"]]