app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("created_at", "description", "finished", "importance", "initial_estimate", "name", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "sprint_id" = ?, "status" = ?, "description" = ?, "finished" = ?, "updated_at" = ? WHERE "tasks"."id" = 1  [["sprint_id", nil], ["status", 2], ["description", ""], ["finished", 0], ["updated_at", Sun, 08 May 2016 15:41:12 UTC +00:00]]