app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "first_name", "login", "password_digest", "project_id", "role", "second_name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)


    respond_to do |format|
      if @user.save

UPDATE "users" SET "second_name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 34  [["second_name", "smith"], ["password_digest", "$2a$10$w8YVW5n0n43OUha7G1D6meC6b5v/7YeARcmOjAwSiQzT6lsabtusa"], ["updated_at", Tue, 17 May 2016 14:18:11 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)